from contextlib import nullcontext
from random import choice

'''
Покупка дома:

Площадь дома в (кв. м): [50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150] (всего = 11 параметров)
Площадь участка в (кв. м): [500, 600, 700, 800, 900]
Возраст дома: (1, 2, 3, 4, 5, 6, 7, 8, 9, 10) всего = 10
Цена(тыс. руб): (2000, 2500, 3000, 4000, 5000, 6000, 7000) всего = 7 

купить: (0, 1)

'''

S = [50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150]
S_u = [500, 600, 700, 800, 900]
T = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
C = [2000, 2500, 3000, 4000, 5000, 6000, 7000]
B = [0, 1]

def data_rand_func(n):
    list_data = list()
    for _ in range(n):
        data_rand = [
            choice(S),
            choice(S_u),
            choice(T),
            choice(C),
            choice(B)
        ]
        list_data.append(data_rand)
    return list_data

data_my = [
    [60, 500, 3, 2000 ,1],
    [50, 500, 10, 2000, 0],
    [60, 600, 9, 2500, 0],
    [70, 700, 8, 3000, 0],
    [80, 800, 7, 3500, 0],
    [90, 900, 6, 4000, 0],
    [100, 500, 5, 4500, 1],
    [110, 600, 4, 5000, 1],
    [120, 700, 3, 5500, 1],
    [130, 800, 2, 6000, 1],
    [140, 900, 1, 6000, 1],
    [150, 500, 10, 7000, 0],
    [50, 500, 9, 2000, 0],
    [60, 600, 8, 2000, 0],
    [70, 700, 7, 3000, 0],
    [80, 800, 6, 3000, 0],
    [90, 900, 5, 4000, 0],
    [100, 500, 4, 4000, 1],
    [100, 600, 3, 5000, 1],
    [100, 700, 2, 5000, 1],
    [100, 800, 1, 6000, 1],
    [100, 900, 10, 6000, 0],
    [100, 500, 9, 7000, 0],
    [60, 600, 7, 2300, 0],
    [90, 700, 5, 3000, 0],
    [100, 800, 3, 4000, 1],
    [100, 900, 2, 6000, 1],
    [100, 800, 1, 6000, 1],
    [100, 900, 3, 6000, 1],
    [100, 800, 2, 6000, 1]
]

print("создать документ из случайных данных?")
data = data_rand_func(30)


if (input() == 'yes'):
    with open('data.txt', 'w+') as file:
        for i in data:
            file.write(str(i) + '\n')
else:
    with open('data.txt', 'w+') as file:
        for i in data_my:
            file.write(str(i) + '\n')
